In [6]:
import pandas as pd
import numpy as np

In [3]:
data1 = {'name':['sara','hanie','maryam'],'age':[22,12,39]}
data2 = {'name':['ali','omid','kasra'],'age':[19,30,27]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
conc = pd.concat([df1,df2])
conc

     name  age
0    sara   22
1   hanie   12
2  maryam   39
0     ali   19
1    omid   30
2   kasra   27

In [5]:
data1 = {'name':['sara','hanie','maryam'],'grade':[22,12,39]}
data2 = {'name':['sara','hanie','maryam'],'grade':[19,30,27]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
mymerg = pd.merge(df1,df2,on='name')
mymerg

     name  grade_x  grade_y
0    sara       22       19
1   hanie       12       30
2  maryam       39       27

In [7]:
df1.set_index('name',inplace=True)
df2.set_index('name',inplace=True)
myjoin = df1.join(df2,lsuffix='_left',rsuffix='_right')
myjoin

        grade_left  grade_right
name
sara            22           19
hanie           12           30
maryam          39           27

In [10]:
df = pd.read_csv('file.csv')
gp = df.groupby('Name')
gp.groups

{'Ali': [0, 1, 2], 'Omid': [9, 10, 11], 'Sadeq': [3, 4], 'Sara': [5, 6, 7, 8]}

In [12]:
def func (self):
    return df.loc[self].Test2 > df.loc[self].Test3
df.groupby(func).groups

{False: [1, 4, 6, 7, 10], True: [0, 2, 3, 5, 8, 9, 11]}